cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF31xR.xml
        <!-- REGISTER "IRQ35MON" -->
        <register>
          <name>IRQ35MON</name>
          <description>IRQ35 Batch Read Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0INT5" -->
            <field>
              <name>USB0INT5</name>
              <description>"Status (SOFIRQ, CMPIRO) interrupt request on the USB ch.0 "</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT4" -->
            <field>
              <name>USB0INT4</name>
              <description>"Status (DIRQ, URIRQ, RWKIRQ, CNNIRQ) interrupt request on the USB ch.0 "</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT3" -->
            <field>
              <name>USB0INT3</name>
              <description>Status (SPK) interrupt request on the USB ch.0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT2" -->
            <field>
              <name>USB0INT2</name>
              <description>"Status (SUSP, SOF, BRST, CONF, WKUP) interrupt request on the USB ch.0 "</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT1" -->
            <field>
              <name>USB0INT1</name>
              <description>Endpoint 0 DRQO interrupt request on the USB ch.0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT0" -->
            <field>
              <name>USB0INT0</name>
              <description>Endpoint 0 DRQI interrupt request on the USB ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ38MON" -->
        <register>
          <name>IRQ38MON</name>
          <description>IRQ38 Batch Read Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ39MON" -->
        <register>
          <name>IRQ39MON</name>
          <description>IRQ39 Batch Read Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ40MON" -->
        <register>
          <name>IRQ40MON</name>
          <description>IRQ40 Batch Read Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.2.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ41MON" -->
        <register>
          <name>IRQ41MON</name>
          <description>IRQ41 Batch Read Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.3.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ42MON" -->
        <register>
          <name>IRQ42MON</name>
          <description>IRQ42 Batch Read Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.4.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ43MON" -->
        <register>
          <name>IRQ43MON</name>
          <description>IRQ43 Batch Read Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.5.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ44MON" -->
        <register>
          <name>IRQ44MON</name>
          <description>IRQ44 Batch Read Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.6.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
