cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF31xR.xml
        <!-- REGISTER "I2C_RDR" -->
        <register>
          <name>I2C_RDR</name>
          <description>Received Data Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
        </register>
        <!-- REGISTER "I2C_TDR" -->
        <register>
          <name>I2C_TDR</name>
          <description>Transmit Data Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x00FF</resetValue>
          <resetMask>0x00FF</resetMask>
        </register>
        <!-- REGISTER "I2C_ISMK" -->
        <register>
          <name>I2C_ISMK</name>
          <description>7-bit Slave Address Mask Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN" -->
            <field>
              <name>EN</name>
              <description>I2C interface operation enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SM" -->
            <field>
              <name>SM</name>
              <description>Slave address mask bits</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_ISBA" -->
        <register>
          <name>I2C_ISBA</name>
          <description>7-bit Slave Address Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SAEN" -->
            <field>
              <name>SAEN</name>
              <description>Slave address enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SA" -->
            <field>
              <name>SA</name>
              <description>7-bit slave address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_BGR" -->
        <register>
          <name>I2C_BGR</name>
          <description>Baud Rate Generator Registers</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BGR1" -->
            <field>
              <name>BGR1</name>
              <description>Baud Rate Generator Registers 1</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR0" -->
            <field>
              <name>BGR0</name>
              <description>Baud Rate Generator Registers 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <!-- INTERRUPT "MFS1RX" -->
      <interrupt>
        <name>MFS1RX</name>
        <value>9</value>
      </interrupt>
      <!-- INTERRUPT "MFS1TX" -->
      <interrupt>
        <name>MFS1TX</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <!-- INTERRUPT "MFS2RX" -->
      <interrupt>
        <name>MFS2RX</name>
        <value>11</value>
      </interrupt>
      <!-- INTERRUPT "MFS2TX" -->
      <interrupt>
        <name>MFS2TX</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <!-- INTERRUPT "MFS3RX" -->
      <interrupt>
        <name>MFS3RX</name>
        <value>13</value>
      </interrupt>
      <!-- INTERRUPT "MFS3TX" -->
      <interrupt>
        <name>MFS3TX</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral>
      <name>MFS4</name>
      <description>Multi-function Serial Interface 4</description>
      <groupName>MFS4</groupName>
      <baseAddress>0x40038400</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "MFS4RX" -->
      <interrupt>
        <name>MFS4RX</name>
        <value>15</value>
      </interrupt>
      <!-- INTERRUPT "MFS4TX" -->
      <interrupt>
        <name>MFS4TX</name>
        <value>16</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UART_SCR" -->
        <register>
          <name>UART_SCR</name>
          <description>Serial Control Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x9F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCL" -->
            <field>
              <name>UPCL</name>
              <description>Programmable Clear bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Received interrupt enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmit interrupt enable bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBIE" -->
            <field>
              <name>TBIE</name>
              <description>Transmit bus idle interrupt enable bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXE" -->
            <field>
              <name>RXE</name>
              <description>Received operation enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXE" -->
            <field>
              <name>TXE</name>
              <description>Transmission operation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UART_SMR" -->
        <register>
          <name>UART_SMR</name>
          <description>Serial Mode Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFD</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>Operation mode set bit</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUCR" -->
            <field>
              <name>WUCR</name>
              <description>Wake-up control bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBL" -->
            <field>
              <name>SBL</name>
              <description>Stop bit length select bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDS" -->
            <field>
              <name>BDS</name>
              <description>Transfer direction select bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOE" -->
            <field>
              <name>SOE</name>
              <description>Serial data output enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UART_SSR" -->
        <register>
          <name>UART_SSR</name>
          <description>Serial Status Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Received error flag clear bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Parity error flag bit (only functions in operation mode 0) </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRE" -->
            <field>
              <name>FRE</name>
              <description>Framing error flag bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ORE" -->
            <field>
              <name>ORE</name>
              <description>Overrun error flag bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>Received data full flag bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>Transmit data empty flag bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TBI" -->
            <field>
              <name>TBI</name>
              <description>Transmit bus idle flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
